In [1]:
from sys import path
from pathlib import Path

import pandas as pd
import numpy as np
pd.options.display.float_format = '{:,.2f}'.format

# Se genera la ruta absoluta al directorio "Comisiones"
path_package = Path.cwd().parent.__str__()

# Se agrega la ruta al directorio sys.path
path.append(path_package)


from algoritmos.algoritmo_ventas_mes import ventas_mes_func
from algoritmos.algoritmo_cobranza_mes import cobranza_mes_func

from descriptions.descriptions import descrip_sales_users_df, descrip_product_df, descrip_partner_df

In [3]:
ventas_enero = ventas_mes_func(1)
ventas_febrero = ventas_mes_func(2)
ventas_marzo = ventas_mes_func(3)
ventas_abril = ventas_mes_func(4)
ventas_mayo = ventas_mes_func(5)

ventas_año = pd.concat([ventas_enero, ventas_febrero, ventas_marzo, ventas_abril, ventas_mayo], ignore_index=True)

In [4]:
ventas_enero.columns

Index(['fact_doc_id', 'name', 'invoice_date', 'state', 'invoice_origin',
       'module_origin', 'pos_doc_id', 'move_type', 'reversal_move_id',
       'reversed_entry_id', 'journal_id', 'company_id', 'partner_id',
       'invoice_user_id', 'fact_line_id', 'product_id', 'quantity',
       'price_unit', 'discount', 'price_subtotal', 'salesperson_id'],
      dtype='object')

In [5]:
cols = ['fact_doc_id', 'name_x', 'quantity', 'price_subtotal', 'salesperson_id',
       'name_y', 'sale_team_description',
       'business_model', 'warehouse']

ventas = (ventas_enero.merge(descrip_sales_users_df, how='left', left_on='salesperson_id', right_on='id'))[cols]

In [6]:
ventas.groupby('name_y', dropna=False).sum()[['quantity', 'price_subtotal']]

                                      quantity  price_subtotal
name_y
Angela Carrillo Cárdenas              3,716.00       98,911.07
Brenda Luz Acosta Lopez              20,036.00      816,593.98
Gladiz Melisa Galvez Espinoza         9,943.78      214,343.07
Irma Carvajal Flores                 27,399.00    1,162,969.62
Karla Jaqueline Rivera Hernández     32,087.70      662,497.42
Leticia Terán Salinas                10,201.31      180,748.29
Mariana Araceli Carvajal Flores          44.00        1,996.99
Mayra Angelica Parada Manjarrez      13,275.17    1,442,589.41
Nadia Santos Nava                     8,715.00      324,790.45
Patricia Flores Pantaleón            11,714.85      192,397.13
Reyna Arriaga Flores                 13,638.30      274,687.44
Viviana Montaño Inzunza               8,871.15      129,913.12
Yamilet Blanco Salas                  3,032.00      315,472.17
Yanin Becerril Barriga                1,373.95       32,645.95
Yolanda Alejandra Rodriguez González 10,110.55      239,725.17

In [7]:
facturas_mes_vendedora = ventas.loc[ventas['name_y'] == 'Mayra Angelica Parada Manjarrez', ['name_x', 'price_subtotal']].groupby(by='name_x').sum()
facturas_mes_vendedora

                  price_subtotal
name_x
F1-CC/2024/00345        1,409.56
F1-CC/2024/00986        2,529.36
F1-CC/2024/01112        2,583.15
F1-VS/2024/00014        5,796.00
F1-VS/2024/00015       23,651.20
...                          ...
F1-VS/2024/00361        5,177.10
F1-VS/2024/00362          256.44
F2-VS/2024/00039        1,892.50
F2-VS/2024/00054          400.34
F2-VS/2024/00061        4,990.00

[147 rows x 1 columns]

In [8]:
# facturas_mes_vendedora.to_excel('Facturas_mes_vendedora.xlsx')

## Algo de <span style="color: steelblue">BI</span>

In [9]:
ventas.groupby('business_model', dropna=False).sum()[['quantity', 'price_subtotal']]

                 quantity  price_subtotal
business_model
CE              63,742.17    3,737,625.18
Piso           110,416.59    2,352,656.10

In [10]:
ventas.groupby('sale_team_description', dropna=False).sum()[['quantity', 'price_subtotal']]

                       quantity  price_subtotal
sale_team_description
A1 CSL                44,072.49      834,334.86
A2 SJC                66,344.10    1,518,321.24
CE A1                 40,674.17    2,605,559.03
CE A2                 23,068.00    1,132,066.15

In [11]:
ventas.groupby('warehouse', dropna=False).sum()[['quantity', 'price_subtotal']]

           quantity  price_subtotal
warehouse
A1        84,746.66    3,439,893.89
A2        89,412.10    2,650,387.39

In [12]:
total_enero = pd.DataFrame(ventas_enero['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])
total_febrero = pd.DataFrame(ventas_febrero['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])
total_marzo = pd.DataFrame(ventas_marzo['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])
total_abril = pd.DataFrame(ventas_abril['price_subtotal'].sum(), columns=['Total de Venta'], index=[0])

In [13]:
print('Enero', total_enero)
print('Febrero', total_febrero)
print('Marzo', total_marzo)
print('Abril', total_abril)

print('Total', total_enero + total_febrero + total_marzo + total_abril)

Enero    Total de Venta
0    6,090,281.28
Febrero    Total de Venta
0    5,829,759.26
Marzo    Total de Venta
0    7,048,084.64
Abril    Total de Venta
0    2,039,436.83
Total    Total de Venta
0   21,007,562.01

In [14]:
ventas.loc[ventas['sale_team_description'].isna()]

Empty DataFrame
Columns: [fact_doc_id, name_x, quantity, price_subtotal, salesperson_id, name_y, sale_team_description, business_model, warehouse]
Index: []